<?php
/**
 * Created by PhpStorm.
 * User: zhaohe
 * Date: 2018/10/31
 * Time: 15:49
 *
 *
 *          二进制位运算
 *      &   与
 *      |   或
 *      ~   非
 *      ^   异或
 *      <<  左移
 *      >>  右移
 */


$a=4; //在进行位运算时，转换为二进制


//一个整数 四个字节 八个二进制位
$b = 2;


// 0000 0000 0000 0000 0000 0000 0000 0100 =>4
// 0000 0000 0000 0000 0000 0000 0000 0010 =>2



var_dump($a & $b); // 0


echo '<br/>';

var_dump($a | $b); // 0


echo '<br/>';

var_dump(~$a); //取反

echo '<br/>';

var_dump($a<<1); // 8
echo '<br/>';
var_dump($a>>1); // 2