<?php
///**
// * Created by PhpStorm.
// * User: zhaohe
// * Date: 2018/10/31
// * Time: 16:33
// */
//
//
////递归调用
//
//// 一、数组
//    1.数组的分类
//
//    1）按键名 :
//
//    关联数组：
//        $arr = array('键名1' => '值1','键名2' => '值2');
//
//    索引数组
//        $arr = array('值1','值2');
//
//    2）按值划分
//        一维数组：数组的值是一个非数组类型
//        多维数组：数组的值是一个数组
//
//
//
//    2.数值的遍历
//        foreach ($arr as $key => $value) {
//
//        }
//    3.数组的操作
//        1)定义
//            $数组名=array('值1','值2');
//            $数组名=['值1','值2'];
//
//            $数组名[] = '新的值';//新增数组元素
//
//        2)使用数组
//
//            $数组名[下标]
//
//        3) 修改数组元素
//            $数组名[下标] = '新的值';
//
//        4)删除
//            unset('数组名');
//
//
//        5）检测数组value
//            isset($数组名[下标]); //检测数组元素
//            is_array($数组名); //检测变量是否是数组
//            in_array('value',$数组名); //检测元素是否在数组内
//
//练习：写一个程序，计算1-1000内所有能被3整除的整数的和
//
//$sum = 0;
//for ($i = 0;$i <1000;$i++) {
//
//    if ($i % 3 == 0) {
//        $sum += $i;
//    }
//}
//echo $sum;
//
//
// // 二、函数
//
//练习：函数实现输出指定函数的星星塔。//见 star.php
//
//
//
//
//
//
//
//
//
//
//
